tap "dty1er/tap"
tap "go-task/tap"
tap "fluxcd/tap"
brew "awscli"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "direnv"
brew "figlet"
brew "findutils"
brew "gettext"
brew "git"
brew "gnupg"
brew "go"
brew "grep"
brew "helm"
brew "krew"
brew "kubernetes-cli"
brew "kubie"
brew "kustomize"
brew "libiconv"
brew "lolcat"
brew "lsd"
brew "nano"
brew "pinentry-mac"
brew "starship"
brew "thefuck"
brew "watch"
brew "dty1er/tap/kubecolor"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
